# Dispose Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
MassGBXMLExportOptions..::..Dispose Method
MassGBXMLExportOptions Class See Also
---
Releases all resources used by the MassGBXMLExportOptions
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public void Dispose()
```

Visual Basic
---
```text
Public Sub Dispose
```

Visual C++
---
```text
public:
virtual void Dispose() sealed
```

# ### Implements
IDisposable..::..Dispose()()()()
# See Also
MassGBXMLExportOptions Class
Autodesk.Revit.DB.Analysis Namespace